use Yarok_MyBASE;

--1-Task--
SELECT Наименование_заказа,
	max(Цена_продажи) [Максимальная цена],
	count(*) [Количество заказанных товаров]
From Заказы Inner Join Товары
	On Заказы.Наименование_заказа = Товары.Наименование
	And Товары.Количество > 5 Group By Наименование_заказа

--3-Task--
SELECT *
	FROM (select Case when Цена_продажи between 1 and 2000 then 'цена < 2000'
		  when Цена_продажи between 2000 and 5000 then 'цена от 2000 до 5000'
		  else 'цена больше 5000'
		  end [Пределы цен], COUNT(*) [Количество]
	FROM Заказы Group by Case
		  when Цена_продажи between 1 and 2000 then 'цена < 2000'
		  when Цена_продажи between 2000 and 5000 then 'цена от 2000 до 5000'
		  else 'цена больше 5000'
		  end) as T
			   Order By Case [Пределы цен]
					when 'цена < 2000' then 3
					when 'цена от 2000 до 5000' then 2
					when 'цена больше 5000' then 1
					else 0
					end
--4-Task--
SELECT g.Наименование_заказа, s.Наименование_фирмы, f.Цена,
	   round(avg(cast(g.Цена_продажи as float(4))), 2) as [Средняя цена]
FROM Товары f inner join Заказы g
	 on f.Наименование = g.Наименование_заказа
	 inner join Заказчики s
	 on g.Заказчик = s.Наименование_фирмы
WHERE f.Цена > 1000
Group By g.Наименование_заказа, s.Наименование_фирмы, f.Цена

--5-Task--
SELECT g.Наименование_заказа, s.Наименование_фирмы, f.Цена,
	   round(avg(cast(g.Цена_продажи as float(4))), 2) as [Средняя цена]
FROM Товары f inner join Заказы g
	 on f.Наименование = g.Наименование_заказа
	 inner join Заказчики s
	 on g.Заказчик = s.Наименование_фирмы
WHERE f.Цена > 1000 and g.Наименование_заказа = 'Кровать'
Group By g.Наименование_заказа, s.Наименование_фирмы, f.Цена

--6-Task--
SELECT Наименование_заказа, Цена_продажи, SUM(Количество) Количество
FROM Заказы
WHERE Наименование_заказа In ('Стол', 'Стул')
GROUP By Наименование_заказа, Цена_продажи

--7-Task--
SELECT p1.Наименование_заказа, p1.Цена_продажи,
	(select COUNT(*) from Заказы p2
	 WHERE p2.Наименование_заказа = p1.Наименование_заказа
	 and p2.Цена_продажи = p1.Цена_продажи) [Количество]
FROM Заказы p1
	 GROUP By p1.Наименование_заказа, p1.Цена_продажи
	 HAVING Цена_продажи < 2000 or Цена_продажи > 5000