USE Yarok_MyBASE;

INSERT into Заказы(Номер_заказа, Наименование_заказа, Цена_продажи, Количество, Дата_поставки, Заказчик) 
			values(1, 'Диван', 1900, 2, '2020-5-7', 'Microsoft'),
				  (2, 'Стол', 1000, 1, '2021-3-1', 'EPAM'),
				  (3, 'Стул', 3000, 7, '2022-1-1', 'IBM'),
				  (4, 'Кровать', 5000, 4, '2024-12-5', 'Apple'),
				  (5, 'Стул', 1200, 3, '2021-10-12', 'Microsoft'),
				  (6, 'Кровать', 8000, 6, '2024-12-5', 'IBM'),
				  (7, 'Стол', 2200, 2, '2023-9-17', 'EPAM'),
				  (8, 'Кровать', 1200, 1, '2025-1-5', 'EPAM');