use Yarok_MyBASE;

--1-Task--
--go
--CREATE VIEW [Заказанные товары]
--	as select Наименование_заказа [Товар],
--			  Цена_продажи [Цена продажи],
--			  Дата_поставки [Дата]
--	from Заказы

--2-Task--
--go
--CREATE VIEW [Сравнение цен]
--	as SELECT zk.Наименование_заказа [Товар],
--			  tv.Цена [Исходная цена],
--			  zk.Цена_продажи [Цена продажи]
--	FROM Заказы zk join Товары tv
--	ON zk.Наименование_заказа = tv.Наименование

--3-Task--
--go
--CREATE VIEW Дорогрие_товары (Товар, Цена, Количество)
--	as select Наименование, Цена, Количество
--	FROM Товары
--	Where Цена > 1000
--go
--	SELECT * FROM Дорогрие_товары

--INSERT Дорогрие_товары values('Шкаф', 1350, 7);
--INSERT Дорогрие_товары values('Тумбочка', 1790, 10);
--SELECT * FROM Дорогрие_товары

--4-Task--
--go
--ALTER VIEW Дорогрие_товары (Товар, Цена, Количество)
--	as select Наименование, Цена, Количество
--	FROM Товары
--	Where Цена > 1000 
--	WITH CHECK OPTION
--go
--INSERT Дорогрие_товары values('Дверь', 900, 9)

--5-Task--
--go
--CREATE VIEW Дорогрие_товары2(Товар, Цена, Количество)
--as select top 150 Наименование, Цена, Количество
--	FROM Товары
--order by Наименование

--6-Task--
go
alter VIEW [Сравнение цен] WITH SCHEMABINDING
	as SELECT zk.Наименование_заказа [Товар],
			  tv.Цена [Исходная цена],
			  zk.Цена_продажи [Цена продажи]
	FROM dbo.Заказы zk join dbo.Товары tv
	ON zk.Наименование_заказа = tv.Наименование